In [3]:
pip install pandas

Requirement already satisfied: pandas in /home/thegodkiller/miniconda3/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /home/thegodkiller/miniconda3/lib/python3.12/site-packages (from pandas) (2.2.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/thegodkiller/miniconda3/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/thegodkiller/miniconda3/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/thegodkiller/miniconda3/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /home/thegodkiller/miniconda3/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [5]:
dict = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Roll No': [1, 2, 3, 4],
    'Age': [23, 24, 21, 22],
    }

In [6]:
df = pd.DataFrame(dict)

In [7]:
df

    Name  Roll No  Age
0   John        1   23
1   Anna        2   24
2  Peter        3   21
3  Linda        4   22

In [8]:
df.head()

    Name  Roll No  Age
0   John        1   23
1   Anna        2   24
2  Peter        3   21
3  Linda        4   22

In [9]:
df.tail()

    Name  Roll No  Age
0   John        1   23
1   Anna        2   24
2  Peter        3   21
3  Linda        4   22

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     4 non-null      object
 1   Roll No  4 non-null      int64
 2   Age      4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [11]:
df.describe()

        Roll No        Age
count  4.000000   4.000000
mean   2.500000  22.500000
std    1.290994   1.290994
min    1.000000  21.000000
25%    1.750000  21.750000
50%    2.500000  22.500000
75%    3.250000  23.250000
max    4.000000  24.000000

In [12]:
df.describe().T

         count  mean       std   min    25%   50%    75%   max
Roll No    4.0   2.5  1.290994   1.0   1.75   2.5   3.25   4.0
Age        4.0  22.5  1.290994  21.0  21.75  22.5  23.25  24.0

In [13]:
df.shape

(4, 3)

In [14]:
df.isnull().sum()

Name       0
Roll No    0
Age        0
dtype: int64

In [16]:
df['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [17]:
df[['Name', 'Age']]

    Name  Age
0   John   23
1   Anna   24
2  Peter   21
3  Linda   22

In [18]:
df.iloc[0]

Name       John
Roll No       1
Age          23
Name: 0, dtype: object

In [19]:
df.iloc[-1]

Name       Linda
Roll No        4
Age           22
Name: 3, dtype: object

In [20]:
df.iloc[0:2]

   Name  Roll No  Age
0  John        1   23
1  Anna        2   24

In [24]:
df.iloc[0:4, 0:4]

    Name  Roll No  Age
0   John        1   23
1   Anna        2   24
2  Peter        3   21
3  Linda        4   22

In [25]:
dict1 = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Roll No': [1, 2, None, 4],
    'Age': [23, 24, 21, 22],
    }

In [26]:
df1 = pd.DataFrame(dict1)

In [27]:
df1

    Name  Roll No  Age
0   John      1.0   23
1   Anna      2.0   24
2  Peter      NaN   21
3  Linda      4.0   22

In [32]:
df.fillna(3)

    Name  Roll No  Age
0   John        1   23
1   Anna        2   24
2  Peter        3   21
3  Linda        4   22

In [33]:
df1['Age'].mean()

np.float64(22.5)

In [38]:
dict2 = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Roll No': [1, 2, 3, 4],
    'Age': [23, None, 21, 22],
    }

In [39]:
df2 = pd.DataFrame(dict2)

In [40]:
df2

    Name  Roll No   Age
0   John        1  23.0
1   Anna        2   NaN
2  Peter        3  21.0
3  Linda        4  22.0

In [41]:
df2['Age'].mean()

np.float64(22.0)

In [48]:
df2.fillna(df2['Age'].mean())

    Name  Roll No   Age
0   John        1  23.0
1   Anna        2  22.0
2  Peter        3  21.0
3  Linda        4  22.0

In [45]:
df2['Age'].median()

np.float64(22.0)

In [46]:
df2['Age'].mode()

0    21.0
1    22.0
2    23.0
Name: Age, dtype: float64

In [52]:
dict3 = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Roll No': [1, 2, 3, None],
    'Age': [23, None, 21, 22],
    }

In [53]:
df3 = pd.DataFrame(dict3)

In [54]:
df3

    Name  Roll No   Age
0   John      1.0  23.0
1   Anna      2.0   NaN
2  Peter      3.0  21.0
3  Linda      NaN  22.0

In [58]:
df3['Roll No'] = df3['Roll No'].fillna(4)

In [59]:
df3

    Name  Roll No   Age
0   John      1.0  23.0
1   Anna      2.0   NaN
2  Peter      3.0  21.0
3  Linda      4.0  22.0

In [60]:
df3['Age'] = df3['Age'].fillna(df3['Age'].mean())

In [61]:
df3

    Name  Roll No   Age
0   John      1.0  23.0
1   Anna      2.0  22.0
2  Peter      3.0  21.0
3  Linda      4.0  22.0